Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEray_bf.h
/** \brief Length for Ifx_ERAY_MHDF_Bits.TNSA */
#define IFX_ERAY_MHDF_TNSA_LEN (1u)

/** \brief Mask for Ifx_ERAY_MHDF_Bits.TNSA */
#define IFX_ERAY_MHDF_TNSA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MHDF_Bits.TNSA */
#define IFX_ERAY_MHDF_TNSA_OFF (6u)

/** \brief Length for Ifx_ERAY_MHDF_Bits.TNSB */
#define IFX_ERAY_MHDF_TNSB_LEN (1u)

/** \brief Mask for Ifx_ERAY_MHDF_Bits.TNSB */
#define IFX_ERAY_MHDF_TNSB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MHDF_Bits.TNSB */
#define IFX_ERAY_MHDF_TNSB_OFF (7u)

/** \brief Length for Ifx_ERAY_MHDF_Bits.WAHP */
#define IFX_ERAY_MHDF_WAHP_LEN (1u)

/** \brief Mask for Ifx_ERAY_MHDF_Bits.WAHP */
#define IFX_ERAY_MHDF_WAHP_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MHDF_Bits.WAHP */
#define IFX_ERAY_MHDF_WAHP_OFF (8u)

/** \brief Length for Ifx_ERAY_TXRQ1_Bits.TXR0 */
#define IFX_ERAY_TXRQ1_TXR0_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ1_Bits.TXR0 */
#define IFX_ERAY_TXRQ1_TXR0_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ1_Bits.TXR0 */
#define IFX_ERAY_TXRQ1_TXR0_OFF (0u)

/** \brief Length for Ifx_ERAY_TXRQ1_Bits.TXR1 */
#define IFX_ERAY_TXRQ1_TXR1_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ1_Bits.TXR1 */
#define IFX_ERAY_TXRQ1_TXR1_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ1_Bits.TXR1 */
#define IFX_ERAY_TXRQ1_TXR1_OFF (1u)

/** \brief Length for Ifx_ERAY_TXRQ1_Bits.TXR2 */
#define IFX_ERAY_TXRQ1_TXR2_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ1_Bits.TXR2 */
#define IFX_ERAY_TXRQ1_TXR2_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ1_Bits.TXR2 */
#define IFX_ERAY_TXRQ1_TXR2_OFF (2u)

/** \brief Length for Ifx_ERAY_TXRQ1_Bits.TXR3 */
#define IFX_ERAY_TXRQ1_TXR3_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ1_Bits.TXR3 */
#define IFX_ERAY_TXRQ1_TXR3_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ1_Bits.TXR3 */
#define IFX_ERAY_TXRQ1_TXR3_OFF (3u)

/** \brief Length for Ifx_ERAY_TXRQ1_Bits.TXR4 */
#define IFX_ERAY_TXRQ1_TXR4_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ1_Bits.TXR4 */
#define IFX_ERAY_TXRQ1_TXR4_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ1_Bits.TXR4 */
#define IFX_ERAY_TXRQ1_TXR4_OFF (4u)

/** \brief Length for Ifx_ERAY_TXRQ1_Bits.TXR5 */
#define IFX_ERAY_TXRQ1_TXR5_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ1_Bits.TXR5 */
#define IFX_ERAY_TXRQ1_TXR5_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ1_Bits.TXR5 */
#define IFX_ERAY_TXRQ1_TXR5_OFF (5u)

/** \brief Length for Ifx_ERAY_TXRQ1_Bits.TXR6 */
#define IFX_ERAY_TXRQ1_TXR6_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ1_Bits.TXR6 */
#define IFX_ERAY_TXRQ1_TXR6_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ1_Bits.TXR6 */
#define IFX_ERAY_TXRQ1_TXR6_OFF (6u)

/** \brief Length for Ifx_ERAY_TXRQ1_Bits.TXR7 */
#define IFX_ERAY_TXRQ1_TXR7_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ1_Bits.TXR7 */
#define IFX_ERAY_TXRQ1_TXR7_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ1_Bits.TXR7 */
#define IFX_ERAY_TXRQ1_TXR7_OFF (7u)

/** \brief Length for Ifx_ERAY_TXRQ1_Bits.TXR8 */
#define IFX_ERAY_TXRQ1_TXR8_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ1_Bits.TXR8 */
#define IFX_ERAY_TXRQ1_TXR8_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ1_Bits.TXR8 */
#define IFX_ERAY_TXRQ1_TXR8_OFF (8u)

/** \brief Length for Ifx_ERAY_TXRQ1_Bits.TXR9 */
#define IFX_ERAY_TXRQ1_TXR9_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ1_Bits.TXR9 */
#define IFX_ERAY_TXRQ1_TXR9_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ1_Bits.TXR9 */
#define IFX_ERAY_TXRQ1_TXR9_OFF (9u)

/** \brief Length for Ifx_ERAY_TXRQ1_Bits.TXR10 */
#define IFX_ERAY_TXRQ1_TXR10_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ1_Bits.TXR10 */
#define IFX_ERAY_TXRQ1_TXR10_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ1_Bits.TXR10 */
#define IFX_ERAY_TXRQ1_TXR10_OFF (10u)

/** \brief Length for Ifx_ERAY_TXRQ1_Bits.TXR11 */
#define IFX_ERAY_TXRQ1_TXR11_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ1_Bits.TXR11 */
#define IFX_ERAY_TXRQ1_TXR11_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ1_Bits.TXR11 */
#define IFX_ERAY_TXRQ1_TXR11_OFF (11u)

/** \brief Length for Ifx_ERAY_TXRQ1_Bits.TXR12 */
#define IFX_ERAY_TXRQ1_TXR12_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ1_Bits.TXR12 */
#define IFX_ERAY_TXRQ1_TXR12_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ1_Bits.TXR12 */
#define IFX_ERAY_TXRQ1_TXR12_OFF (12u)

/** \brief Length for Ifx_ERAY_TXRQ1_Bits.TXR13 */
#define IFX_ERAY_TXRQ1_TXR13_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ1_Bits.TXR13 */
#define IFX_ERAY_TXRQ1_TXR13_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ1_Bits.TXR13 */
#define IFX_ERAY_TXRQ1_TXR13_OFF (13u)

/** \brief Length for Ifx_ERAY_TXRQ1_Bits.TXR14 */
#define IFX_ERAY_TXRQ1_TXR14_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ1_Bits.TXR14 */
#define IFX_ERAY_TXRQ1_TXR14_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ1_Bits.TXR14 */
#define IFX_ERAY_TXRQ1_TXR14_OFF (14u)

/** \brief Length for Ifx_ERAY_TXRQ1_Bits.TXR15 */
#define IFX_ERAY_TXRQ1_TXR15_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ1_Bits.TXR15 */
#define IFX_ERAY_TXRQ1_TXR15_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ1_Bits.TXR15 */
#define IFX_ERAY_TXRQ1_TXR15_OFF (15u)

/** \brief Length for Ifx_ERAY_TXRQ1_Bits.TXR16 */
#define IFX_ERAY_TXRQ1_TXR16_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ1_Bits.TXR16 */
#define IFX_ERAY_TXRQ1_TXR16_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ1_Bits.TXR16 */
#define IFX_ERAY_TXRQ1_TXR16_OFF (16u)

/** \brief Length for Ifx_ERAY_TXRQ1_Bits.TXR17 */
#define IFX_ERAY_TXRQ1_TXR17_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ1_Bits.TXR17 */
#define IFX_ERAY_TXRQ1_TXR17_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ1_Bits.TXR17 */
#define IFX_ERAY_TXRQ1_TXR17_OFF (17u)

/** \brief Length for Ifx_ERAY_TXRQ1_Bits.TXR18 */
#define IFX_ERAY_TXRQ1_TXR18_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ1_Bits.TXR18 */
#define IFX_ERAY_TXRQ1_TXR18_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ1_Bits.TXR18 */
#define IFX_ERAY_TXRQ1_TXR18_OFF (18u)

/** \brief Length for Ifx_ERAY_TXRQ1_Bits.TXR19 */
#define IFX_ERAY_TXRQ1_TXR19_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ1_Bits.TXR19 */
#define IFX_ERAY_TXRQ1_TXR19_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ1_Bits.TXR19 */
#define IFX_ERAY_TXRQ1_TXR19_OFF (19u)

