Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEray_bf.h
/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC57 */
#define IFX_ERAY_MBSC2_MBC57_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC57 */
#define IFX_ERAY_MBSC2_MBC57_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC57 */
#define IFX_ERAY_MBSC2_MBC57_OFF (25u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC58 */
#define IFX_ERAY_MBSC2_MBC58_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC58 */
#define IFX_ERAY_MBSC2_MBC58_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC58 */
#define IFX_ERAY_MBSC2_MBC58_OFF (26u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC59 */
#define IFX_ERAY_MBSC2_MBC59_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC59 */
#define IFX_ERAY_MBSC2_MBC59_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC59 */
#define IFX_ERAY_MBSC2_MBC59_OFF (27u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC60 */
#define IFX_ERAY_MBSC2_MBC60_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC60 */
#define IFX_ERAY_MBSC2_MBC60_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC60 */
#define IFX_ERAY_MBSC2_MBC60_OFF (28u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC61 */
#define IFX_ERAY_MBSC2_MBC61_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC61 */
#define IFX_ERAY_MBSC2_MBC61_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC61 */
#define IFX_ERAY_MBSC2_MBC61_OFF (29u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC62 */
#define IFX_ERAY_MBSC2_MBC62_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC62 */
#define IFX_ERAY_MBSC2_MBC62_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC62 */
#define IFX_ERAY_MBSC2_MBC62_OFF (30u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC63 */
#define IFX_ERAY_MBSC2_MBC63_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC63 */
#define IFX_ERAY_MBSC2_MBC63_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC63 */
#define IFX_ERAY_MBSC2_MBC63_OFF (31u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC64 */
#define IFX_ERAY_MBSC3_MBC64_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC64 */
#define IFX_ERAY_MBSC3_MBC64_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC64 */
#define IFX_ERAY_MBSC3_MBC64_OFF (0u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC65 */
#define IFX_ERAY_MBSC3_MBC65_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC65 */
#define IFX_ERAY_MBSC3_MBC65_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC65 */
#define IFX_ERAY_MBSC3_MBC65_OFF (1u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC66 */
#define IFX_ERAY_MBSC3_MBC66_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC66 */
#define IFX_ERAY_MBSC3_MBC66_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC66 */
#define IFX_ERAY_MBSC3_MBC66_OFF (2u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC67 */
#define IFX_ERAY_MBSC3_MBC67_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC67 */
#define IFX_ERAY_MBSC3_MBC67_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC67 */
#define IFX_ERAY_MBSC3_MBC67_OFF (3u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC68 */
#define IFX_ERAY_MBSC3_MBC68_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC68 */
#define IFX_ERAY_MBSC3_MBC68_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC68 */
#define IFX_ERAY_MBSC3_MBC68_OFF (4u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC69 */
#define IFX_ERAY_MBSC3_MBC69_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC69 */
#define IFX_ERAY_MBSC3_MBC69_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC69 */
#define IFX_ERAY_MBSC3_MBC69_OFF (5u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC70 */
#define IFX_ERAY_MBSC3_MBC70_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC70 */
#define IFX_ERAY_MBSC3_MBC70_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC70 */
#define IFX_ERAY_MBSC3_MBC70_OFF (6u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC71 */
#define IFX_ERAY_MBSC3_MBC71_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC71 */
#define IFX_ERAY_MBSC3_MBC71_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC71 */
#define IFX_ERAY_MBSC3_MBC71_OFF (7u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC72 */
#define IFX_ERAY_MBSC3_MBC72_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC72 */
#define IFX_ERAY_MBSC3_MBC72_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC72 */
#define IFX_ERAY_MBSC3_MBC72_OFF (8u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC73 */
#define IFX_ERAY_MBSC3_MBC73_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC73 */
#define IFX_ERAY_MBSC3_MBC73_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC73 */
#define IFX_ERAY_MBSC3_MBC73_OFF (9u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC74 */
#define IFX_ERAY_MBSC3_MBC74_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC74 */
#define IFX_ERAY_MBSC3_MBC74_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC74 */
#define IFX_ERAY_MBSC3_MBC74_OFF (10u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC75 */
#define IFX_ERAY_MBSC3_MBC75_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC75 */
#define IFX_ERAY_MBSC3_MBC75_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC75 */
#define IFX_ERAY_MBSC3_MBC75_OFF (11u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC76 */
#define IFX_ERAY_MBSC3_MBC76_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC76 */
#define IFX_ERAY_MBSC3_MBC76_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC76 */
#define IFX_ERAY_MBSC3_MBC76_OFF (12u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC77 */
#define IFX_ERAY_MBSC3_MBC77_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC77 */
#define IFX_ERAY_MBSC3_MBC77_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC77 */
#define IFX_ERAY_MBSC3_MBC77_OFF (13u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC78 */
#define IFX_ERAY_MBSC3_MBC78_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC78 */
#define IFX_ERAY_MBSC3_MBC78_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC78 */
#define IFX_ERAY_MBSC3_MBC78_OFF (14u)

/** \brief Length for Ifx_ERAY_MBSC3_Bits.MBC79 */
#define IFX_ERAY_MBSC3_MBC79_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC3_Bits.MBC79 */
#define IFX_ERAY_MBSC3_MBC79_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC3_Bits.MBC79 */
#define IFX_ERAY_MBSC3_MBC79_OFF (15u)

