Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEray_bf.h
/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP52 */
#define IFX_ERAY_MSIC2_MSIP52_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP52 */
#define IFX_ERAY_MSIC2_MSIP52_OFF (20u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP53 */
#define IFX_ERAY_MSIC2_MSIP53_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP53 */
#define IFX_ERAY_MSIC2_MSIP53_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP53 */
#define IFX_ERAY_MSIC2_MSIP53_OFF (21u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP54 */
#define IFX_ERAY_MSIC2_MSIP54_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP54 */
#define IFX_ERAY_MSIC2_MSIP54_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP54 */
#define IFX_ERAY_MSIC2_MSIP54_OFF (22u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP55 */
#define IFX_ERAY_MSIC2_MSIP55_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP55 */
#define IFX_ERAY_MSIC2_MSIP55_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP55 */
#define IFX_ERAY_MSIC2_MSIP55_OFF (23u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP56 */
#define IFX_ERAY_MSIC2_MSIP56_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP56 */
#define IFX_ERAY_MSIC2_MSIP56_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP56 */
#define IFX_ERAY_MSIC2_MSIP56_OFF (24u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP57 */
#define IFX_ERAY_MSIC2_MSIP57_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP57 */
#define IFX_ERAY_MSIC2_MSIP57_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP57 */
#define IFX_ERAY_MSIC2_MSIP57_OFF (25u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP58 */
#define IFX_ERAY_MSIC2_MSIP58_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP58 */
#define IFX_ERAY_MSIC2_MSIP58_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP58 */
#define IFX_ERAY_MSIC2_MSIP58_OFF (26u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP59 */
#define IFX_ERAY_MSIC2_MSIP59_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP59 */
#define IFX_ERAY_MSIC2_MSIP59_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP59 */
#define IFX_ERAY_MSIC2_MSIP59_OFF (27u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP60 */
#define IFX_ERAY_MSIC2_MSIP60_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP60 */
#define IFX_ERAY_MSIC2_MSIP60_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP60 */
#define IFX_ERAY_MSIC2_MSIP60_OFF (28u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP61 */
#define IFX_ERAY_MSIC2_MSIP61_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP61 */
#define IFX_ERAY_MSIC2_MSIP61_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP61 */
#define IFX_ERAY_MSIC2_MSIP61_OFF (29u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP62 */
#define IFX_ERAY_MSIC2_MSIP62_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP62 */
#define IFX_ERAY_MSIC2_MSIP62_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP62 */
#define IFX_ERAY_MSIC2_MSIP62_OFF (30u)

/** \brief Length for Ifx_ERAY_MSIC2_Bits.MSIP63 */
#define IFX_ERAY_MSIC2_MSIP63_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC2_Bits.MSIP63 */
#define IFX_ERAY_MSIC2_MSIP63_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC2_Bits.MSIP63 */
#define IFX_ERAY_MSIC2_MSIP63_OFF (31u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP64 */
#define IFX_ERAY_MSIC3_MSIP64_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP64 */
#define IFX_ERAY_MSIC3_MSIP64_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP64 */
#define IFX_ERAY_MSIC3_MSIP64_OFF (0u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP65 */
#define IFX_ERAY_MSIC3_MSIP65_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP65 */
#define IFX_ERAY_MSIC3_MSIP65_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP65 */
#define IFX_ERAY_MSIC3_MSIP65_OFF (1u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP66 */
#define IFX_ERAY_MSIC3_MSIP66_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP66 */
#define IFX_ERAY_MSIC3_MSIP66_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP66 */
#define IFX_ERAY_MSIC3_MSIP66_OFF (2u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP67 */
#define IFX_ERAY_MSIC3_MSIP67_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP67 */
#define IFX_ERAY_MSIC3_MSIP67_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP67 */
#define IFX_ERAY_MSIC3_MSIP67_OFF (3u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP68 */
#define IFX_ERAY_MSIC3_MSIP68_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP68 */
#define IFX_ERAY_MSIC3_MSIP68_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP68 */
#define IFX_ERAY_MSIC3_MSIP68_OFF (4u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP69 */
#define IFX_ERAY_MSIC3_MSIP69_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP69 */
#define IFX_ERAY_MSIC3_MSIP69_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP69 */
#define IFX_ERAY_MSIC3_MSIP69_OFF (5u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP70 */
#define IFX_ERAY_MSIC3_MSIP70_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP70 */
#define IFX_ERAY_MSIC3_MSIP70_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP70 */
#define IFX_ERAY_MSIC3_MSIP70_OFF (6u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP71 */
#define IFX_ERAY_MSIC3_MSIP71_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP71 */
#define IFX_ERAY_MSIC3_MSIP71_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP71 */
#define IFX_ERAY_MSIC3_MSIP71_OFF (7u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP72 */
#define IFX_ERAY_MSIC3_MSIP72_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP72 */
#define IFX_ERAY_MSIC3_MSIP72_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP72 */
#define IFX_ERAY_MSIC3_MSIP72_OFF (8u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP73 */
#define IFX_ERAY_MSIC3_MSIP73_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP73 */
#define IFX_ERAY_MSIC3_MSIP73_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP73 */
#define IFX_ERAY_MSIC3_MSIP73_OFF (9u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP74 */
#define IFX_ERAY_MSIC3_MSIP74_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP74 */
#define IFX_ERAY_MSIC3_MSIP74_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP74 */
#define IFX_ERAY_MSIC3_MSIP74_OFF (10u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP75 */
#define IFX_ERAY_MSIC3_MSIP75_LEN (1u)

