Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEray_bf.h
/** \brief Mask for Ifx_ERAY_OTSS_Bits.OTGB0 */
#define IFX_ERAY_OTSS_OTGB0_MSK (0x3u)

/** \brief Offset for Ifx_ERAY_OTSS_Bits.OTGB0 */
#define IFX_ERAY_OTSS_OTGB0_OFF (0u)

/** \brief Length for Ifx_ERAY_OTSS_Bits.OTGB1 */
#define IFX_ERAY_OTSS_OTGB1_LEN (2u)

/** \brief Mask for Ifx_ERAY_OTSS_Bits.OTGB1 */
#define IFX_ERAY_OTSS_OTGB1_MSK (0x3u)

/** \brief Offset for Ifx_ERAY_OTSS_Bits.OTGB1 */
#define IFX_ERAY_OTSS_OTGB1_OFF (8u)

/** \brief Length for Ifx_ERAY_OTSS_Bits.OTGB2 */
#define IFX_ERAY_OTSS_OTGB2_LEN (1u)

/** \brief Mask for Ifx_ERAY_OTSS_Bits.OTGB2 */
#define IFX_ERAY_OTSS_OTGB2_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_OTSS_Bits.OTGB2 */
#define IFX_ERAY_OTSS_OTGB2_OFF (16u)

/** \brief Length for Ifx_ERAY_OCS_Bits.SUS */
#define IFX_ERAY_OCS_SUS_LEN (4u)

/** \brief Mask for Ifx_ERAY_OCS_Bits.SUS */
#define IFX_ERAY_OCS_SUS_MSK (0xfu)

/** \brief Offset for Ifx_ERAY_OCS_Bits.SUS */
#define IFX_ERAY_OCS_SUS_OFF (24u)

/** \brief Length for Ifx_ERAY_OCS_Bits.SUS_P */
#define IFX_ERAY_OCS_SUS_P_LEN (1u)

/** \brief Mask for Ifx_ERAY_OCS_Bits.SUS_P */
#define IFX_ERAY_OCS_SUS_P_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_OCS_Bits.SUS_P */
#define IFX_ERAY_OCS_SUS_P_OFF (28u)

/** \brief Length for Ifx_ERAY_OCS_Bits.SUSSTA */
#define IFX_ERAY_OCS_SUSSTA_LEN (1u)

/** \brief Mask for Ifx_ERAY_OCS_Bits.SUSSTA */
#define IFX_ERAY_OCS_SUSSTA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_OCS_Bits.SUSSTA */
#define IFX_ERAY_OCS_SUSSTA_OFF (29u)

/** \brief Length for Ifx_ERAY_KRSTCLR_Bits.CLR */
#define IFX_ERAY_KRSTCLR_CLR_LEN (1u)

/** \brief Mask for Ifx_ERAY_KRSTCLR_Bits.CLR */
#define IFX_ERAY_KRSTCLR_CLR_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_KRSTCLR_Bits.CLR */
#define IFX_ERAY_KRSTCLR_CLR_OFF (0u)

/** \brief Length for Ifx_ERAY_KRST1_Bits.RST */
#define IFX_ERAY_KRST1_RST_LEN (1u)

/** \brief Mask for Ifx_ERAY_KRST1_Bits.RST */
#define IFX_ERAY_KRST1_RST_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_KRST1_Bits.RST */
#define IFX_ERAY_KRST1_RST_OFF (0u)

/** \brief Length for Ifx_ERAY_KRST0_Bits.RST */
#define IFX_ERAY_KRST0_RST_LEN (1u)

/** \brief Mask for Ifx_ERAY_KRST0_Bits.RST */
#define IFX_ERAY_KRST0_RST_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_KRST0_Bits.RST */
#define IFX_ERAY_KRST0_RST_OFF (0u)

/** \brief Length for Ifx_ERAY_KRST0_Bits.RSTSTAT */
#define IFX_ERAY_KRST0_RSTSTAT_LEN (1u)

/** \brief Mask for Ifx_ERAY_KRST0_Bits.RSTSTAT */
#define IFX_ERAY_KRST0_RSTSTAT_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_KRST0_Bits.RSTSTAT */
#define IFX_ERAY_KRST0_RSTSTAT_OFF (1u)

/** \brief Length for Ifx_ERAY_ACCEN0_Bits.EN0 */
#define IFX_ERAY_ACCEN0_EN0_LEN (1u)

/** \brief Mask for Ifx_ERAY_ACCEN0_Bits.EN0 */
#define IFX_ERAY_ACCEN0_EN0_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_ACCEN0_Bits.EN0 */
#define IFX_ERAY_ACCEN0_EN0_OFF (0u)

/** \brief Length for Ifx_ERAY_ACCEN0_Bits.EN1 */
#define IFX_ERAY_ACCEN0_EN1_LEN (1u)

/** \brief Mask for Ifx_ERAY_ACCEN0_Bits.EN1 */
#define IFX_ERAY_ACCEN0_EN1_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_ACCEN0_Bits.EN1 */
#define IFX_ERAY_ACCEN0_EN1_OFF (1u)

/** \brief Length for Ifx_ERAY_ACCEN0_Bits.EN2 */
#define IFX_ERAY_ACCEN0_EN2_LEN (1u)

/** \brief Mask for Ifx_ERAY_ACCEN0_Bits.EN2 */
#define IFX_ERAY_ACCEN0_EN2_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_ACCEN0_Bits.EN2 */
#define IFX_ERAY_ACCEN0_EN2_OFF (2u)

/** \brief Length for Ifx_ERAY_ACCEN0_Bits.EN3 */
#define IFX_ERAY_ACCEN0_EN3_LEN (1u)

/** \brief Mask for Ifx_ERAY_ACCEN0_Bits.EN3 */
#define IFX_ERAY_ACCEN0_EN3_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_ACCEN0_Bits.EN3 */
#define IFX_ERAY_ACCEN0_EN3_OFF (3u)

/** \brief Length for Ifx_ERAY_ACCEN0_Bits.EN4 */
#define IFX_ERAY_ACCEN0_EN4_LEN (1u)

/** \brief Mask for Ifx_ERAY_ACCEN0_Bits.EN4 */
#define IFX_ERAY_ACCEN0_EN4_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_ACCEN0_Bits.EN4 */
#define IFX_ERAY_ACCEN0_EN4_OFF (4u)

/** \brief Length for Ifx_ERAY_ACCEN0_Bits.EN5 */
#define IFX_ERAY_ACCEN0_EN5_LEN (1u)

/** \brief Mask for Ifx_ERAY_ACCEN0_Bits.EN5 */
#define IFX_ERAY_ACCEN0_EN5_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_ACCEN0_Bits.EN5 */
#define IFX_ERAY_ACCEN0_EN5_OFF (5u)

/** \brief Length for Ifx_ERAY_ACCEN0_Bits.EN6 */
#define IFX_ERAY_ACCEN0_EN6_LEN (1u)

/** \brief Mask for Ifx_ERAY_ACCEN0_Bits.EN6 */
#define IFX_ERAY_ACCEN0_EN6_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_ACCEN0_Bits.EN6 */
#define IFX_ERAY_ACCEN0_EN6_OFF (6u)

/** \brief Length for Ifx_ERAY_ACCEN0_Bits.EN7 */
#define IFX_ERAY_ACCEN0_EN7_LEN (1u)

/** \brief Mask for Ifx_ERAY_ACCEN0_Bits.EN7 */
#define IFX_ERAY_ACCEN0_EN7_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_ACCEN0_Bits.EN7 */
#define IFX_ERAY_ACCEN0_EN7_OFF (7u)

/** \brief Length for Ifx_ERAY_ACCEN0_Bits.EN8 */
#define IFX_ERAY_ACCEN0_EN8_LEN (1u)

/** \brief Mask for Ifx_ERAY_ACCEN0_Bits.EN8 */
#define IFX_ERAY_ACCEN0_EN8_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_ACCEN0_Bits.EN8 */
#define IFX_ERAY_ACCEN0_EN8_OFF (8u)

/** \brief Length for Ifx_ERAY_ACCEN0_Bits.EN9 */
#define IFX_ERAY_ACCEN0_EN9_LEN (1u)

/** \brief Mask for Ifx_ERAY_ACCEN0_Bits.EN9 */
#define IFX_ERAY_ACCEN0_EN9_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_ACCEN0_Bits.EN9 */
#define IFX_ERAY_ACCEN0_EN9_OFF (9u)

/** \brief Length for Ifx_ERAY_ACCEN0_Bits.EN10 */
#define IFX_ERAY_ACCEN0_EN10_LEN (1u)

/** \brief Mask for Ifx_ERAY_ACCEN0_Bits.EN10 */
#define IFX_ERAY_ACCEN0_EN10_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_ACCEN0_Bits.EN10 */
#define IFX_ERAY_ACCEN0_EN10_OFF (10u)

/** \brief Length for Ifx_ERAY_ACCEN0_Bits.EN11 */
#define IFX_ERAY_ACCEN0_EN11_LEN (1u)

/** \brief Mask for Ifx_ERAY_ACCEN0_Bits.EN11 */
#define IFX_ERAY_ACCEN0_EN11_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_ACCEN0_Bits.EN11 */
#define IFX_ERAY_ACCEN0_EN11_OFF (11u)

/** \brief Length for Ifx_ERAY_ACCEN0_Bits.EN12 */
#define IFX_ERAY_ACCEN0_EN12_LEN (1u)

/** \brief Mask for Ifx_ERAY_ACCEN0_Bits.EN12 */
#define IFX_ERAY_ACCEN0_EN12_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_ACCEN0_Bits.EN12 */
#define IFX_ERAY_ACCEN0_EN12_OFF (12u)

/** \brief Length for Ifx_ERAY_ACCEN0_Bits.EN13 */
#define IFX_ERAY_ACCEN0_EN13_LEN (1u)

/** \brief Mask for Ifx_ERAY_ACCEN0_Bits.EN13 */
#define IFX_ERAY_ACCEN0_EN13_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_ACCEN0_Bits.EN13 */
#define IFX_ERAY_ACCEN0_EN13_OFF (13u)

